#### Terraform Plan Output 

```
data.archive_file.lambda: Reading...
data.archive_file.lambda: Read complete after 0s [id=42977e8493b27782e563dfb2c492e1bfea2c8349]
data.aws_caller_identity.current: Reading...
aws_iam_role.scanner: Refreshing state... [id=S3ScannerRole]
aws_s3_bucket.log_bucket_public_rw: Refreshing state... [id=cyb611-secure-phish-bits-public-rw-logs]
aws_s3_bucket.log_bucket_no_encryption: Refreshing state... [id=cyb611-secure-phish-bits-no-encryption-logs]
aws_s3_bucket.insecure_bucket2: Refreshing state... [id=cyb611-secure-phish-bits-public-rw]
aws_s3_bucket.log_bucket: Refreshing state... [id=cyb611-access-logs-phish-bits-12345]
aws_s3_bucket.secure_bucket: Refreshing state... [id=cyb611-secure-phish-bits-12345]
aws_s3_bucket.insecure_bucket1: Refreshing state... [id=cyb611-secure-phish-bits-no-encryption]
aws_s3_bucket.trail_bucket: Refreshing state... [id=cyb611-cloudtrail-logs-phish-bits-12345]
aws_s3_bucket.insecure_bucket: Refreshing state... [id=cyb611-insecure-phish-bits-12345]
data.aws_caller_identity.current: Read complete after 0s [id=151462990345]
aws_iam_role_policy.scanner: Refreshing state... [id=S3ScannerRole:S3ScannerPolicy]
aws_lambda_function.scanner: Refreshing state... [id=S3SecurityScanner]
aws_lambda_function_url.scanner: Refreshing state... [id=S3SecurityScanner]
aws_s3_bucket_ownership_controls.log_public_rw_ownership: Refreshing state... [id=cyb611-secure-phish-bits-public-rw-logs]
aws_s3_bucket_public_access_block.block: Refreshing state... [id=cyb611-secure-phish-bits-12345]
aws_s3_bucket_versioning.versioning: Refreshing state... [id=cyb611-secure-phish-bits-12345]
aws_s3_bucket_policy.enforce_tls: Refreshing state... [id=cyb611-secure-phish-bits-12345]
aws_s3_bucket_server_side_encryption_configuration.encryption: Refreshing state... [id=cyb611-secure-phish-bits-12345]
aws_s3_bucket_ownership_controls.ownership: Refreshing state... [id=cyb611-secure-phish-bits-12345]
aws_cloudtrail.main_trail: Refreshing state... [id=arn:aws:cloudtrail:us-east-2:151462990345:trail/cyb611-management-events-trail]
aws_s3_bucket_policy.trail_bucket_policy: Refreshing state... [id=cyb611-cloudtrail-logs-phish-bits-12345]
aws_s3_bucket_ownership_controls.log_ownership: Refreshing state... [id=cyb611-access-logs-phish-bits-12345]
aws_s3_bucket_logging.example: Refreshing state... [id=cyb611-secure-phish-bits-12345]
aws_s3_bucket_public_access_block.log_public_access_no_encryption: Refreshing state... [id=cyb611-secure-phish-bits-no-encryption-logs]
aws_s3_bucket_ownership_controls.log_ownership_no_encryption: Refreshing state... [id=cyb611-secure-phish-bits-no-encryption-logs]
aws_s3_bucket_cors_configuration.insecure_cors: Refreshing state... [id=cyb611-insecure-phish-bits-12345]
aws_s3_bucket_public_access_block.insecure_block: Refreshing state... [id=cyb611-insecure-phish-bits-12345]
aws_s3_bucket_versioning.insecure_versioning: Refreshing state... [id=cyb611-insecure-phish-bits-12345]
aws_s3_bucket_ownership_controls.insecure_ownership: Refreshing state... [id=cyb611-insecure-phish-bits-12345]
aws_s3_bucket_acl.log_public_rw_acl: Refreshing state... [id=cyb611-secure-phish-bits-public-rw-logs,log-delivery-write]
aws_s3_bucket_acl.log_acl: Refreshing state... [id=cyb611-access-logs-phish-bits-12345,log-delivery-write]
aws_s3_bucket_policy.insecure_policy: Refreshing state... [id=cyb611-insecure-phish-bits-12345]
aws_s3_bucket_acl.log_acl_no_encryption: Refreshing state... [id=cyb611-secure-phish-bits-no-encryption-logs,log-delivery-write]
aws_s3_bucket_acl.insecure_acl: Refreshing state... [id=cyb611-insecure-phish-bits-12345,public-read]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_s3_bucket.insecure_bucket2 has changed
  ~ resource "aws_s3_bucket" "insecure_bucket2" {
      + arn           = "arn:aws:s3:::cyb611-secure-phish-bits-public-rw"
        id            = "cyb611-secure-phish-bits-public-rw"
        tags          = {
            "Environment" = "Test"
            "Misconfig"   = "public-read-write"
            "Name"        = "CYB611 Insecure – Public Read/Write"
        }
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.insecure_bucket1 is tainted, so must be replaced
-/+ resource "aws_s3_bucket" "insecure_bucket1" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::cyb611-secure-phish-bits-no-encryption" -> (known after apply)
      ~ bucket_domain_name          = "cyb611-secure-phish-bits-no-encryption.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "cyb611-secure-phish-bits-no-encryption.s3.us-east-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2O1EMRO9K5GLX" -> (known after apply)
      ~ id                          = "cyb611-secure-phish-bits-no-encryption" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          + "Environment" = "Test"
          + "Misconfig"   = "no-encryption"
          + "Name"        = "CYB611 Insecure - No Encryption"
        }
      ~ tags_all                    = {
          + "Environment" = "Test"
          + "Misconfig"   = "no-encryption"
          + "Name"        = "CYB611 Insecure - No Encryption"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # aws_s3_bucket.insecure_bucket2 is tainted, so must be replaced
-/+ resource "aws_s3_bucket" "insecure_bucket2" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::cyb611-secure-phish-bits-public-rw" -> (known after apply)
      ~ bucket_domain_name          = "cyb611-secure-phish-bits-public-rw.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "cyb611-secure-phish-bits-public-rw.s3.us-east-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2O1EMRO9K5GLX" -> (known after apply)
      ~ id                          = "cyb611-secure-phish-bits-public-rw" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          + "Environment" = "Test"
          + "Misconfig"   = "public-read-write"
          + "Name"        = "CYB611 Insecure - Public Read/Write"
        }
      ~ tags_all                    = {
          + "Environment" = "Test"
          + "Misconfig"   = "public-read-write"
          + "Name"        = "CYB611 Insecure - Public Read/Write"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # aws_s3_bucket_logging.logging_no_encryption will be created
  + resource "aws_s3_bucket_logging" "logging_no_encryption" {
      + bucket        = (known after apply)
      + id            = (known after apply)
      + target_bucket = "cyb611-secure-phish-bits-no-encryption-logs"
      + target_prefix = "log/"
    }

  # aws_s3_bucket_logging.public_rw_logging will be created
  + resource "aws_s3_bucket_logging" "public_rw_logging" {
      + bucket        = (known after apply)
      + id            = (known after apply)
      + target_bucket = "cyb611-secure-phish-bits-public-rw-logs"
      + target_prefix = "log/"
    }

  # aws_s3_bucket_ownership_controls.ownership_no_encryption will be created
  + resource "aws_s3_bucket_ownership_controls" "ownership_no_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_ownership_controls.public_rw_ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "public_rw_ownership" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_policy.public_rw_enforce_tls will be created
  + resource "aws_s3_bucket_policy" "public_rw_enforce_tls" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_policy.public_rw_policy will be created
  + resource "aws_s3_bucket_policy" "public_rw_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.block_no_encryption will be created
  + resource "aws_s3_bucket_public_access_block" "block_no_encryption" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.public_rw_block will be created
  + resource "aws_s3_bucket_public_access_block" "public_rw_block" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # aws_s3_bucket_server_side_encryption_configuration.public_rw_encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "public_rw_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.public_rw_versioning will be created
  + resource "aws_s3_bucket_versioning" "public_rw_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_bucket_versioning.versioning_no_encryption will be created
  + resource "aws_s3_bucket_versioning" "versioning_no_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 13 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```